{"approval_requested":0,"approved":1,"beaming":"1","database_id":844,"db_version":1,"deleted":0,"description":"Door\/Window Sensor","device_ref":"0003:1082","exclusion":"<p>REMOVE DOOR SENSOR FROM Z-WAVE NETWORK<\/p> <ol><li>Make sure doorsensoris powered on.<\/li> <li>Set Z-Wave gateway into exclusion mode (Refer to gateway user manual).<\/li> <li>Press the code button in door sensor three times continuously, then door sensor will enter exclusion mode. Meanwhile, LED light would flash red color five times on and off alternately.<\/li> <li>Wait for gateway to remove the sensor.<\/li> <\/ol>","first_approval_time":"0000-00-00 00:00:00","frequently_listening":"0","inclusion":"<p>ADD DOOR SENSOR TO Z-WAVE NETWORK<\/p> <ol><li>Disassemble the main body of door sensor by pressing the disassemble button, then install battery. After making it powered on, please do not operate it within 20 s.<\/li> <li>Place door sensor within Z-Wave network range of gateway.<\/li> <li>Set Z-Wave gateway into inclusion mode (Refer to gateway user manual).<\/li> <li>Press the code button in door sensor three times continuously, then door sensor will enter inclusion mode. Meanwhile, LED light would flash red color five times on and off alternately.<\/li> <li>Door sensor will be detected and included in the Z<\/li> <\/ol>","label":"0131","last_approval_time":"2019-10-07 18:12:12","listening":"0","overview":"<p>Door sensor is an intelligent security equipment that can transmit through Z-Wave network and radio waves. In the Z-Wave network communications, door sensor can be connected to any Z-Wave gateway. Door sensor can send messages to Z-Wave gateway, then realize association with other devices. Different countries or areas, the radio frequency is different.<\/p> <p>Each door sensor has a unique ID code. When we add or remove door sensor from gateway, just place it in the Z-Wave network range of gateway. Then we can easily find the door sensor through device ID code. In the communication with Z-Wave gateway, door sensor can only send messages to Z-Wave gateway, but can not receive messages. When alarm is triggered, door sensor would send messages to gateway, then Z-Wave gateway would display the current status of door sensor. At the same time, door sensor can realize association with other devices through Z-Wave gateway. Door sensor is powered by batteries, with small body, and can be installed on the window or door easily. When door or window is open, door sensor would be triggered, then associates with other devices to work, to realize the goal of safety protection.<\/p>","protocol_version":"0.000","routing":"1","usage":"","uuid":"zipds01z","version_max":"3.080","version_min":"3.080","wakeup":"<p>Door sensor stays in dormant state for the majority of time in orderto conserve battery life.<\/p> <p>The minimum wakeup interval is 300s (5 minutes).<\/p> <p>The maximum wakeup interval is 16,777,200s (about 194 days)<\/p> <p>Allowable min step among each wakeup interval is 60 seconds, such as 360s, 420s, 480s...<\/p> <p>NOTE: The default value is 12 hours. The larger the value is, the greater the battery life is.<\/p>","manufacturer":{"id":45,"label":"Zipato","reference":305,"uuid":"zipato","url":"http:\/\/www.zipato.com\/"},"category":{"id":6,"label":"Door","category":"Door","description":"Door sensors"},"endpoints":[],"parameters":[],"associations":[],"documents":[]}